In [38]:
import pandas as pd

In [40]:
customer_data = pd.DataFrame({'CustomerID': [1, 2, 3, 4, 5],'Name': ['John', 'Jane', None, 'Alice', 'Bob'],'Purchase': [200, 300, 150, None, 500]})

In [42]:
customer_data

   CustomerID   Name  Purchase
0           1   John     200.0
1           2   Jane     300.0
2           3   None     150.0
3           4  Alice       NaN
4           5    Bob     500.0

In [44]:
missing_values_count = customer_data.isnull().sum()
print("Number of missing values in each column:")
print(missing_values_count)

Number of missing values in each column:
CustomerID    0
Name          1
Purchase      1
dtype: int64

In [46]:
customer_data['Name'].fillna('Unknown', inplace=True)

C:\Users\aadil\AppData\Local\Temp\ipykernel_14436\2896344371.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customer_data['Name'].fillna('Unknown', inplace=True)

In [48]:
customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice       NaN
4           5      Bob     500.0

In [56]:
purchase_median = customer_data['Purchase'].mean()
customer_data['Purchase'].fillna(purchase_median)

0    200.0
1    300.0
2    150.0
3    250.0
4    500.0
Name: Purchase, dtype: float64

In [58]:
customer_data.dropna(inplace=True)

In [60]:
customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

In [62]:
above_median_purchases = customer_data[customer_data['Purchase'] > purchase_median]
print("Customers who made purchases above the median value:")
print(above_median_purchases)

Customers who made purchases above the median value:
   CustomerID  Name  Purchase
1           2  Jane     300.0
4           5   Bob     500.0